; domain
(define (domain emergencias)
    (:requirements :strips :typing)
    (:types
        location box bcontent grip person dron - object
    )

    (:predicates
        (at-dron ?d - dron ?l - location) 
        (at-box ?b - box ?l - location)
        (at-person ?p - person ?l - location)
        
        (box-has ?b - box ?c - bcontent)
        (person-has ?p - person ?c - bcontent)
        
        (free ?g - grip)
        (carrying ?d - dron ?g - grip ?b - box)
    )


    (:action move
        :parameters (?from - location ?to - location ?dron - dron)
        :precondition (at-dron ?dron ?from)
        :effect (and (at-dron ?dron ?to)(not(at-dron ?dron ?from)))
    )

    (:action pick
        :parameters (?box - box ?location - location ?gripper - grip ?dron - dron)
        :precondition (and (at-dron ?dron ?location)(at-box ?box ?location)(free ?gripper))
        :effect (and (not (at-box ?box ?location))(not (free ?gripper))(carrying ?dron ?gripper ?box))
    )

    (:action leave
        :parameters (?box - box ?location - location ?gripper - grip ?dron - dron ?person - person ?content - bcontent)
        :precondition (and (at-dron ?dron ?location)(carrying ?dron ?gripper ?box)(at-person ?person ?location)(box-has ?box ?content))
        :effect (and (at-box ?box ?location)(free ?gripper)(not(carrying ?dron ?gripper ?box))(person-has ?person ?content)(not(box-has ?box ?content)))
    )
)

; problem
(define (problem drone_problem_d1_l27_p27_c27_g27)
(:domain emergencias)
(:objects
	dron1 - dron
	deposito refugio1 refugio2 refugio3 refugio4 refugio5 refugio6 refugio7 refugio8 refugio9 refugio10 refugio11 refugio12 refugio13 refugio14 refugio15 refugio16 refugio17 refugio18 refugio19 refugio20 refugio21 refugio22 refugio23 refugio24 refugio25 refugio26 refugio27 - location
	box1 box2 box3 box4 box5 box6 box7 box8 box9 box10 box11 box12 box13 box14 box15 box16 box17 box18 box19 box20 box21 box22 box23 box24 box25 box26 box27 - box
	comida medicina - bcontent
	person1 person2 person3 person4 person5 person6 person7 person8 person9 person10 person11 person12 person13 person14 person15 person16 person17 person18 person19 person20 person21 person22 person23 person24 person25 person26 person27 - person
	dron1-izq dron1-der - grip
)

(:init
	(at-dron dron1 deposito)
	(free dron1-izq)
	(free dron1-der)
	(at-box box1 deposito)
	(box-has box1 comida)
	(at-box box2 deposito)
	(box-has box2 comida)
	(at-box box3 deposito)
	(box-has box3 comida)
	(at-box box4 deposito)
	(box-has box4 comida)
	(at-box box5 deposito)
	(box-has box5 comida)
	(at-box box6 deposito)
	(box-has box6 comida)
	(at-box box7 deposito)
	(box-has box7 comida)
	(at-box box8 deposito)
	(box-has box8 comida)
	(at-box box9 deposito)
	(box-has box9 comida)
	(at-box box10 deposito)
	(box-has box10 comida)
	(at-box box11 deposito)
	(box-has box11 comida)
	(at-box box12 deposito)
	(box-has box12 comida)
	(at-box box13 deposito)
	(box-has box13 comida)
	(at-box box14 deposito)
	(box-has box14 comida)
	(at-box box15 deposito)
	(box-has box15 medicina)
	(at-box box16 deposito)
	(box-has box16 medicina)
	(at-box box17 deposito)
	(box-has box17 medicina)
	(at-box box18 deposito)
	(box-has box18 medicina)
	(at-box box19 deposito)
	(box-has box19 medicina)
	(at-box box20 deposito)
	(box-has box20 medicina)
	(at-box box21 deposito)
	(box-has box21 medicina)
	(at-box box22 deposito)
	(box-has box22 medicina)
	(at-box box23 deposito)
	(box-has box23 medicina)
	(at-box box24 deposito)
	(box-has box24 medicina)
	(at-box box25 deposito)
	(box-has box25 medicina)
	(at-box box26 deposito)
	(box-has box26 medicina)
	(at-box box27 deposito)
	(box-has box27 medicina)
	(at-person person1 refugio23)
	(at-person person2 refugio10)
	(at-person person3 refugio22)
	(at-person person4 refugio10)
	(at-person person5 refugio13)
	(at-person person6 refugio14)
	(at-person person7 refugio16)
	(at-person person8 refugio13)
	(at-person person9 refugio7)
	(at-person person10 refugio2)
	(at-person person11 refugio6)
	(at-person person12 refugio3)
	(at-person person13 refugio12)
	(at-person person14 refugio21)
	(at-person person15 refugio24)
	(at-person person16 refugio13)
	(at-person person17 refugio18)
	(at-person person18 refugio24)
	(at-person person19 refugio8)
	(at-person person20 refugio1)
	(at-person person21 refugio10)
	(at-person person22 refugio23)
	(at-person person23 refugio4)
	(at-person person24 refugio17)
	(at-person person25 refugio24)
	(at-person person26 refugio24)
	(at-person person27 refugio22)
)

(:goal (and
	(person-has person1 comida)
	(person-has person2 comida)
	(person-has person2 medicina)
	(person-has person5 medicina)
	(person-has person6 comida)
	(person-has person6 medicina)
	(person-has person7 medicina)
	(person-has person8 comida)
	(person-has person9 comida)
	(person-has person9 medicina)
	(person-has person11 medicina)
	(person-has person12 medicina)
	(person-has person14 comida)
	(person-has person14 medicina)
	(person-has person15 comida)
	(person-has person15 medicina)
	(person-has person17 comida)
	(person-has person18 comida)
	(person-has person20 comida)
	(person-has person22 comida)
	(person-has person22 medicina)
	(person-has person23 comida)
	(person-has person23 medicina)
	(person-has person24 medicina)
	(person-has person25 medicina)
	(person-has person26 comida)
	(person-has person27 comida)
))
)

; plan
1. (pick box27 deposito dron1-der dron1)
   deleted: (at-box box27 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box27)
   goals met: 0 of 27
2. (pick box14 deposito dron1-izq dron1)
   deleted: (at-box box14 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box14)
   goals met: 0 of 27
3. (move deposito refugio10 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio10)
   goals met: 0 of 27
4. (move refugio10 refugio16 dron1)
   deleted: (at-dron dron1 refugio10)
   added: (at-dron dron1 refugio16)
   goals met: 0 of 27
5. (leave box27 refugio16 dron1-der dron1 person7 medicina)
   deleted: (carrying dron1 dron1-der box27) (box-has box27 medicina)
   added: (at-box box27 refugio16) (free dron1-der) (person-has person7 medicina)
   goals met: 1 of 27
6. (move refugio16 deposito dron1)
   deleted: (at-dron dron1 refugio16)
   added: (at-dron dron1 deposito)
   goals met: 1 of 27
7. (pick box26 deposito dron1-der dron1)
   deleted: (at-box box26 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box26)
   goals met: 1 of 27
8. (move deposito refugio10 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio10)
   goals met: 1 of 27
9. (move refugio10 refugio6 dron1)
   deleted: (at-dron dron1 refugio10)
   added: (at-dron dron1 refugio6)
   goals met: 1 of 27
10. (leave box26 refugio6 dron1-der dron1 person11 medicina)
   deleted: (carrying dron1 dron1-der box26) (box-has box26 medicina)
   added: (at-box box26 refugio6) (free dron1-der) (person-has person11 medicina)
   goals met: 2 of 27
11. (move refugio6 deposito dron1)
   deleted: (at-dron dron1 refugio6)
   added: (at-dron dron1 deposito)
   goals met: 2 of 27
12. (pick box25 deposito dron1-der dron1)
   deleted: (at-box box25 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box25)
   goals met: 2 of 27
13. (move deposito refugio10 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio10)
   goals met: 2 of 27
14. (move refugio10 refugio3 dron1)
   deleted: (at-dron dron1 refugio10)
   added: (at-dron dron1 refugio3)
   goals met: 2 of 27
15. (leave box25 refugio3 dron1-der dron1 person12 medicina)
   deleted: (carrying dron1 dron1-der box25) (box-has box25 medicina)
   added: (at-box box25 refugio3) (free dron1-der) (person-has person12 medicina)
   goals met: 3 of 27
16. (move refugio3 deposito dron1)
   deleted: (at-dron dron1 refugio3)
   added: (at-dron dron1 deposito)
   goals met: 3 of 27
17. (pick box24 deposito dron1-der dron1)
   deleted: (at-box box24 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box24)
   goals met: 3 of 27
18. (move deposito refugio10 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio10)
   goals met: 3 of 27
19. (move refugio10 refugio18 dron1)
   deleted: (at-dron dron1 refugio10)
   added: (at-dron dron1 refugio18)
   goals met: 3 of 27
20. (leave box14 refugio18 dron1-izq dron1 person17 comida)
   deleted: (carrying dron1 dron1-izq box14) (box-has box14 comida)
   added: (at-box box14 refugio18) (free dron1-izq) (person-has person17 comida)
   goals met: 4 of 27
21. (move refugio18 deposito dron1)
   deleted: (at-dron dron1 refugio18)
   added: (at-dron dron1 deposito)
   goals met: 4 of 27
22. (pick box13 deposito dron1-izq dron1)
   deleted: (at-box box13 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box13)
   goals met: 4 of 27
23. (move deposito refugio10 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio10)
   goals met: 4 of 27
24. (move refugio10 refugio1 dron1)
   deleted: (at-dron dron1 refugio10)
   added: (at-dron dron1 refugio1)
   goals met: 4 of 27
25. (leave box13 refugio1 dron1-izq dron1 person20 comida)
   deleted: (carrying dron1 dron1-izq box13) (box-has box13 comida)
   added: (at-box box13 refugio1) (free dron1-izq) (person-has person20 comida)
   goals met: 5 of 27
26. (move refugio1 deposito dron1)
   deleted: (at-dron dron1 refugio1)
   added: (at-dron dron1 deposito)
   goals met: 5 of 27
27. (pick box12 deposito dron1-izq dron1)
   deleted: (at-box box12 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box12)
   goals met: 5 of 27
28. (move deposito refugio10 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio10)
   goals met: 5 of 27
29. (move refugio10 refugio17 dron1)
   deleted: (at-dron dron1 refugio10)
   added: (at-dron dron1 refugio17)
   goals met: 5 of 27
30. (leave box24 refugio17 dron1-der dron1 person24 medicina)
   deleted: (carrying dron1 dron1-der box24) (box-has box24 medicina)
   added: (at-box box24 refugio17) (free dron1-der) (person-has person24 medicina)
   goals met: 6 of 27
31. (move refugio17 deposito dron1)
   deleted: (at-dron dron1 refugio17)
   added: (at-dron dron1 deposito)
   goals met: 6 of 27
32. (pick box23 deposito dron1-der dron1)
   deleted: (at-box box23 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box23)
   goals met: 6 of 27
33. (move deposito refugio10 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio10)
   goals met: 6 of 27
34. (move refugio10 refugio22 dron1)
   deleted: (at-dron dron1 refugio10)
   added: (at-dron dron1 refugio22)
   goals met: 6 of 27
35. (leave box12 refugio22 dron1-izq dron1 person27 comida)
   deleted: (carrying dron1 dron1-izq box12) (box-has box12 comida)
   added: (at-box box12 refugio22) (free dron1-izq) (person-has person27 comida)
   goals met: 7 of 27
36. (move refugio22 deposito dron1)
   deleted: (at-dron dron1 refugio22)
   added: (at-dron dron1 deposito)
   goals met: 7 of 27
37. (pick box11 deposito dron1-izq dron1)
   deleted: (at-box box11 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box11)
   goals met: 7 of 27
38. (move deposito refugio10 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio10)
   goals met: 7 of 27
39. (leave box11 refugio10 dron1-izq dron1 person2 comida)
   deleted: (carrying dron1 dron1-izq box11) (box-has box11 comida)
   added: (at-box box11 refugio10) (free dron1-izq) (person-has person2 comida)
   goals met: 8 of 27
40. (move refugio10 deposito dron1)
   deleted: (at-dron dron1 refugio10)
   added: (at-dron dron1 deposito)
   goals met: 8 of 27
41. (pick box10 deposito dron1-izq dron1)
   deleted: (at-box box10 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box10)
   goals met: 8 of 27
42. (move deposito refugio10 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio10)
   goals met: 8 of 27
43. (leave box23 refugio10 dron1-der dron1 person2 medicina)
   deleted: (carrying dron1 dron1-der box23) (box-has box23 medicina)
   added: (at-box box23 refugio10) (free dron1-der) (person-has person2 medicina)
   goals met: 9 of 27
44. (move refugio10 deposito dron1)
   deleted: (at-dron dron1 refugio10)
   added: (at-dron dron1 deposito)
   goals met: 9 of 27
45. (pick box22 deposito dron1-der dron1)
   deleted: (at-box box22 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box22)
   goals met: 9 of 27
46. (move deposito refugio14 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio14)
   goals met: 9 of 27
47. (leave box10 refugio14 dron1-izq dron1 person6 comida)
   deleted: (carrying dron1 dron1-izq box10) (box-has box10 comida)
   added: (at-box box10 refugio14) (free dron1-izq) (person-has person6 comida)
   goals met: 10 of 27
48. (move refugio14 deposito dron1)
   deleted: (at-dron dron1 refugio14)
   added: (at-dron dron1 deposito)
   goals met: 10 of 27
49. (pick box9 deposito dron1-izq dron1)
   deleted: (at-box box9 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box9)
   goals met: 10 of 27
50. (move deposito refugio14 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio14)
   goals met: 10 of 27
51. (leave box22 refugio14 dron1-der dron1 person6 medicina)
   deleted: (carrying dron1 dron1-der box22) (box-has box22 medicina)
   added: (at-box box22 refugio14) (free dron1-der) (person-has person6 medicina)
   goals met: 11 of 27
52. (move refugio14 deposito dron1)
   deleted: (at-dron dron1 refugio14)
   added: (at-dron dron1 deposito)
   goals met: 11 of 27
53. (pick box21 deposito dron1-der dron1)
   deleted: (at-box box21 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box21)
   goals met: 11 of 27
54. (move deposito refugio13 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio13)
   goals met: 11 of 27
55. (leave box21 refugio13 dron1-der dron1 person5 medicina)
   deleted: (carrying dron1 dron1-der box21) (box-has box21 medicina)
   added: (at-box box21 refugio13) (free dron1-der) (person-has person5 medicina)
   goals met: 12 of 27
56. (move refugio13 deposito dron1)
   deleted: (at-dron dron1 refugio13)
   added: (at-dron dron1 deposito)
   goals met: 12 of 27
57. (pick box20 deposito dron1-der dron1)
   deleted: (at-box box20 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box20)
   goals met: 12 of 27
58. (move deposito refugio13 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio13)
   goals met: 12 of 27
59. (leave box9 refugio13 dron1-izq dron1 person8 comida)
   deleted: (carrying dron1 dron1-izq box9) (box-has box9 comida)
   added: (at-box box9 refugio13) (free dron1-izq) (person-has person8 comida)
   goals met: 13 of 27
60. (move refugio13 deposito dron1)
   deleted: (at-dron dron1 refugio13)
   added: (at-dron dron1 deposito)
   goals met: 13 of 27
61. (pick box8 deposito dron1-izq dron1)
   deleted: (at-box box8 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box8)
   goals met: 13 of 27
62. (move deposito refugio7 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio7)
   goals met: 13 of 27
63. (leave box8 refugio7 dron1-izq dron1 person9 comida)
   deleted: (carrying dron1 dron1-izq box8) (box-has box8 comida)
   added: (at-box box8 refugio7) (free dron1-izq) (person-has person9 comida)
   goals met: 14 of 27
64. (move refugio7 deposito dron1)
   deleted: (at-dron dron1 refugio7)
   added: (at-dron dron1 deposito)
   goals met: 14 of 27
65. (pick box7 deposito dron1-izq dron1)
   deleted: (at-box box7 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box7)
   goals met: 14 of 27
66. (move deposito refugio7 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio7)
   goals met: 14 of 27
67. (leave box20 refugio7 dron1-der dron1 person9 medicina)
   deleted: (carrying dron1 dron1-der box20) (box-has box20 medicina)
   added: (at-box box20 refugio7) (free dron1-der) (person-has person9 medicina)
   goals met: 15 of 27
68. (move refugio7 deposito dron1)
   deleted: (at-dron dron1 refugio7)
   added: (at-dron dron1 deposito)
   goals met: 15 of 27
69. (pick box19 deposito dron1-der dron1)
   deleted: (at-box box19 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box19)
   goals met: 15 of 27
70. (move deposito refugio21 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio21)
   goals met: 15 of 27
71. (leave box7 refugio21 dron1-izq dron1 person14 comida)
   deleted: (carrying dron1 dron1-izq box7) (box-has box7 comida)
   added: (at-box box7 refugio21) (free dron1-izq) (person-has person14 comida)
   goals met: 16 of 27
72. (move refugio21 deposito dron1)
   deleted: (at-dron dron1 refugio21)
   added: (at-dron dron1 deposito)
   goals met: 16 of 27
73. (pick box6 deposito dron1-izq dron1)
   deleted: (at-box box6 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box6)
   goals met: 16 of 27
74. (move deposito refugio21 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio21)
   goals met: 16 of 27
75. (leave box19 refugio21 dron1-der dron1 person14 medicina)
   deleted: (carrying dron1 dron1-der box19) (box-has box19 medicina)
   added: (at-box box19 refugio21) (free dron1-der) (person-has person14 medicina)
   goals met: 17 of 27
76. (move refugio21 deposito dron1)
   deleted: (at-dron dron1 refugio21)
   added: (at-dron dron1 deposito)
   goals met: 17 of 27
77. (pick box18 deposito dron1-der dron1)
   deleted: (at-box box18 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box18)
   goals met: 17 of 27
78. (move deposito refugio23 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio23)
   goals met: 17 of 27
79. (leave box6 refugio23 dron1-izq dron1 person1 comida)
   deleted: (carrying dron1 dron1-izq box6) (box-has box6 comida)
   added: (at-box box6 refugio23) (free dron1-izq) (person-has person1 comida)
   goals met: 18 of 27
80. (move refugio23 deposito dron1)
   deleted: (at-dron dron1 refugio23)
   added: (at-dron dron1 deposito)
   goals met: 18 of 27
81. (pick box5 deposito dron1-izq dron1)
   deleted: (at-box box5 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box5)
   goals met: 18 of 27
82. (move deposito refugio23 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio23)
   goals met: 18 of 27
83. (leave box5 refugio23 dron1-izq dron1 person22 comida)
   deleted: (carrying dron1 dron1-izq box5) (box-has box5 comida)
   added: (at-box box5 refugio23) (free dron1-izq) (person-has person22 comida)
   goals met: 19 of 27
84. (move refugio23 deposito dron1)
   deleted: (at-dron dron1 refugio23)
   added: (at-dron dron1 deposito)
   goals met: 19 of 27
85. (pick box4 deposito dron1-izq dron1)
   deleted: (at-box box4 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box4)
   goals met: 19 of 27
86. (move deposito refugio23 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio23)
   goals met: 19 of 27
87. (leave box18 refugio23 dron1-der dron1 person22 medicina)
   deleted: (carrying dron1 dron1-der box18) (box-has box18 medicina)
   added: (at-box box18 refugio23) (free dron1-der) (person-has person22 medicina)
   goals met: 20 of 27
88. (move refugio23 deposito dron1)
   deleted: (at-dron dron1 refugio23)
   added: (at-dron dron1 deposito)
   goals met: 20 of 27
89. (pick box17 deposito dron1-der dron1)
   deleted: (at-box box17 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box17)
   goals met: 20 of 27
90. (move deposito refugio4 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio4)
   goals met: 20 of 27
91. (leave box4 refugio4 dron1-izq dron1 person23 comida)
   deleted: (carrying dron1 dron1-izq box4) (box-has box4 comida)
   added: (at-box box4 refugio4) (free dron1-izq) (person-has person23 comida)
   goals met: 21 of 27
92. (move refugio4 deposito dron1)
   deleted: (at-dron dron1 refugio4)
   added: (at-dron dron1 deposito)
   goals met: 21 of 27
93. (pick box3 deposito dron1-izq dron1)
   deleted: (at-box box3 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box3)
   goals met: 21 of 27
94. (move deposito refugio4 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio4)
   goals met: 21 of 27
95. (leave box17 refugio4 dron1-der dron1 person23 medicina)
   deleted: (carrying dron1 dron1-der box17) (box-has box17 medicina)
   added: (at-box box17 refugio4) (free dron1-der) (person-has person23 medicina)
   goals met: 22 of 27
96. (move refugio4 deposito dron1)
   deleted: (at-dron dron1 refugio4)
   added: (at-dron dron1 deposito)
   goals met: 22 of 27
97. (pick box16 deposito dron1-der dron1)
   deleted: (at-box box16 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box16)
   goals met: 22 of 27
98. (move deposito refugio24 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio24)
   goals met: 22 of 27
99. (leave box3 refugio24 dron1-izq dron1 person15 comida)
   deleted: (carrying dron1 dron1-izq box3) (box-has box3 comida)
   added: (at-box box3 refugio24) (free dron1-izq) (person-has person15 comida)
   goals met: 23 of 27
100. (move refugio24 deposito dron1)
   deleted: (at-dron dron1 refugio24)
   added: (at-dron dron1 deposito)
   goals met: 23 of 27
101. (pick box2 deposito dron1-izq dron1)
   deleted: (at-box box2 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box2)
   goals met: 23 of 27
102. (move deposito refugio24 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio24)
   goals met: 23 of 27
103. (leave box16 refugio24 dron1-der dron1 person15 medicina)
   deleted: (carrying dron1 dron1-der box16) (box-has box16 medicina)
   added: (at-box box16 refugio24) (free dron1-der) (person-has person15 medicina)
   goals met: 24 of 27
104. (move refugio24 deposito dron1)
   deleted: (at-dron dron1 refugio24)
   added: (at-dron dron1 deposito)
   goals met: 24 of 27
105. (pick box15 deposito dron1-der dron1)
   deleted: (at-box box15 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box15)
   goals met: 24 of 27
106. (move deposito refugio24 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio24)
   goals met: 24 of 27
107. (leave box15 refugio24 dron1-der dron1 person25 medicina)
   deleted: (carrying dron1 dron1-der box15) (box-has box15 medicina)
   added: (at-box box15 refugio24) (free dron1-der) (person-has person25 medicina)
   goals met: 25 of 27
108. (leave box2 refugio24 dron1-izq dron1 person18 comida)
   deleted: (carrying dron1 dron1-izq box2) (box-has box2 comida)
   added: (at-box box2 refugio24) (free dron1-izq) (person-has person18 comida)
   goals met: 26 of 27
109. (move refugio24 deposito dron1)
   deleted: (at-dron dron1 refugio24)
   added: (at-dron dron1 deposito)
   goals met: 26 of 27
110. (pick box1 deposito dron1-der dron1)
   deleted: (at-box box1 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box1)
   goals met: 26 of 27
111. (move deposito refugio24 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio24)
   goals met: 26 of 27
112. (leave box1 refugio24 dron1-der dron1 person26 comida)
   deleted: (carrying dron1 dron1-der box1) (box-has box1 comida)
   added: (at-box box1 refugio24) (free dron1-der) (person-has person26 comida)
   goals met: 27 of 27
